In [1]:
import pandas as pd

# Concatenate

Demonstration of concat method to join dataframes.

In [6]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [7]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
    "altitude": [1000, 700, 5000]
})
df2

        city  humidity  altitude
0    chicago        65      1000
1   new york        68       700
2  san diego        71      5000

### Concat along axis 0 and axs 1

In [14]:
x = pd.concat([df1,df2], axis = 0, sort = False)
x

        city  temperature  humidity  altitude
0   new york         21.0       NaN       NaN
1    chicago         14.0       NaN       NaN
2    orlando         35.0       NaN       NaN
3  baltimore         38.0       NaN       NaN
0    chicago          NaN      65.0    1000.0
1   new york          NaN      68.0     700.0
2  san diego          NaN      71.0    5000.0

In [24]:
x = pd.concat([df1,df2], axis = 1, sort = False)
x

        city  temperature       city  humidity  altitude
0   new york           21    chicago      65.0    1000.0
1    chicago           14   new york      68.0     700.0
2    orlando           35  san diego      71.0    5000.0
3  baltimore           38        NaN       NaN       NaN

### pass keys for multi-index, along axis 0 or axis 1

In [21]:
x = pd.concat([df1,df2], axis = 0, sort = False, keys = ["df1", "df2"])
x

            city  temperature  humidity  altitude
df1 0   new york         21.0       NaN       NaN
    1    chicago         14.0       NaN       NaN
    2    orlando         35.0       NaN       NaN
    3  baltimore         38.0       NaN       NaN
df2 0    chicago          NaN      65.0    1000.0
    1   new york          NaN      68.0     700.0
    2  san diego          NaN      71.0    5000.0

In [25]:
x = pd.concat([df1,df2], axis = 1, sort = False, join = "outer", keys = ["df1", "df2"])
x

         df1                    df2
        city temperature       city humidity altitude
0   new york          21    chicago     65.0   1000.0
1    chicago          14   new york     68.0    700.0
2    orlando          35  san diego     71.0   5000.0
3  baltimore          38        NaN      NaN      NaN

### Can do "inner" concat: this limits to matching index values

In [16]:
x = pd.concat([df1,df2], axis = 1, sort = False, join = "inner")
x

       city  temperature       city  humidity  altitude
0  new york           21    chicago        65      1000
1   chicago           14   new york        68       700
2   orlando           35  san diego        71      5000

In [26]:
x = pd.concat([df1,df2], axis = 0, sort = False, join = "inner")
x

        city
0   new york
1    chicago
2    orlando
3  baltimore
0    chicago
1   new york
2  san diego

# Merge

Examples of every combination of merge, SQL join equivalent for JOIN:
    
    1) INNER
    OUTER:
    2) OUTER JOIN
    3) OUTER Excluding JOIN
    LEFT:
    4) LEFT JOIN
    5) LEFT excluding JOIN
    RIGHT:
    6) RIGHT JOIN
    7) RIGHT excluding JOIN

In [29]:
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [30]:
df2

        city  humidity  altitude
0    chicago        65      1000
1   new york        68       700
2  san diego        71      5000

### Inner join

In [32]:
df1.merge(df2, how = "inner", on = "city")

       city  temperature  humidity  altitude
0  new york           21        68       700
1   chicago           14        65      1000

### Outer Join

In [33]:
df1.merge(df2, how = "outer", on = "city")

        city  temperature  humidity  altitude
0   new york         21.0      68.0     700.0
1    chicago         14.0      65.0    1000.0
2    orlando         35.0       NaN       NaN
3  baltimore         38.0       NaN       NaN
4  san diego          NaN      71.0    5000.0

### Outer excluding join

In [48]:
x = df1.merge(df2, on = "city", how = "outer", indicator = True)
x[x["_merge"] != "both"]

        city  temperature  humidity  altitude      _merge
2    orlando         35.0       NaN       NaN   left_only
3  baltimore         38.0       NaN       NaN   left_only
4  san diego          NaN      71.0    5000.0  right_only

### Left Join

In [50]:
df1.merge(df2, on = "city", how = "left")

        city  temperature  humidity  altitude
0   new york           21      68.0     700.0
1    chicago           14      65.0    1000.0
2    orlando           35       NaN       NaN
3  baltimore           38       NaN       NaN

### Left  excluding Join

In [54]:
x = df1.merge(df2, on = "city", how = "left", indicator = True)
x[x["_merge"] == "left_only"]

        city  temperature  humidity  altitude     _merge
2    orlando           35       NaN       NaN  left_only
3  baltimore           38       NaN       NaN  left_only

### Right excluding join 

Follow same process as left excluding join :)

# Data selection
https://sergilehkyi.com/translating-sql-to-pandas/

In [57]:
df2

        city  humidity  altitude
0    chicago        65      1000
1   new york        68       700
2  san diego        71      5000

In [60]:
# Select first 2 columns where humidity is above 65

df2[df2["humidity"] > 65].loc[:,["city", "humidity"]]

        city  humidity
1   new york        68
2  san diego        71

In [66]:
# select all data where humidity is above 65 AND altitude is above 1000

df2[(df2["humidity"] > 65) & (df2["altitude"]>1000)]

        city  humidity  altitude
2  san diego        71      5000

In [64]:
(df2["altitude"]>1000)

0    False
1    False
2     True
Name: altitude, dtype: bool

In [67]:
# select all data where humidity is above 65 OR altitude is above 1000

df2[(df2["humidity"] > 65) | (df2["altitude"]>1000)]

        city  humidity  altitude
1   new york        68       700
2  san diego        71      5000

In [73]:
#multiple arguments

arg1 = (df2["humidity"].between(60,70))
arg2 = (df2["city"].isin(["new york","san diego"]))

df2[arg1 & arg2]

       city  humidity  altitude
1  new york        68       700